12/data/attachments/6c5d44cfa9cb401.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_96faaca7-9f55-4475-aa2f-a65f87d7b536</nif:username>
            <nif:friendToBeAdded>Michael_discussion_Actions_42890_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>